{
  "backend/main.mo": "Motoko canister implementing authorization, user profiles, order CRUD, and sensitive file storage with access control checks.",
  "feature_evidence.json": "Feature evidence report mapping issues and enhancements to affected frontend files and components.",
  "frontend-file-summaries.txt": "JSON listing short summaries for all frontend files, describing UI behavior, error handling, and infrastructure details.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend CSS.",
  "frontend/index.html": "Arabic RTL HTML entry point loading the React application.",
  "frontend/src/App.tsx": "Main app shell with authentication, profile setup, tab navigation, and an error boundary to prevent blank screens.",
  "frontend/src/components/auth/LoginGate.tsx": "Gate component that blocks access until the user logs in via Internet Identity.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for entering and saving the user's display name with defensive modal cleanup.",
  "frontend/src/components/reminders/ReminderDialog.tsx": "Reminder popup showing order details and performing defensive cleanup on close.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "React error boundary that catches render errors, logs details, and shows a reload screen with cleanup handling.",
  "frontend/src/features/orders/OrderTrackingSection.tsx": "UI for managing orders with create, edit, delete, reminders, and notification permission handling.",
  "frontend/src/features/orders/useReminderScheduler.ts": "Hook that checks orders for due reminders, triggers notifications, and tracks dismissed reminders via localStorage.",
  "frontend/src/features/pdf/pdfjsConfig.ts": "Loads PDF.js from a CDN at runtime and exposes configured PDF.js APIs for PDF processing.",
  "frontend/src/features/pdf/pdfScan.ts": "Utility that scans PDF text for sensitive words using PDF.js, reporting matches and progress.",
  "frontend/src/features/pdf/PdfUploadSection.tsx": "PDF upload and scanning UI handling progress, errors, and sensitive word detection using backend APIs.",
  "frontend/src/features/sensitiveWords/SensitiveWordsSection.tsx": "Interface to add, edit, delete, and view sensitive words with masking and modal dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing related queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, sensitive file uploads, sensitive word management, and order operations using the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles, theme variables, dark mode, and RTL-friendly typography and layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/utils/modalCleanup.ts": "Restores document and body styles to fix leftover modal side effects like locked scrolling or hidden content.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL parameters, including support for hash-based routing and session storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, containers, animations, and integrates plugins like typography and container queries.",
  "project_state.json": "Describes the project state, features, and known issues for an Arabic RTL app with PDF upload, sensitive words management, and order tracking. Includes architectural notes and reports multiple blank‑screen and upload failures flagged for fixes."
}