{
  "backend/main.mo": "Motoko actor providing authorization, user profiles, order CRUD, and sensitive file storage using mixins and access control checks.",
  "feature_evidence.json": "Feature evidence report mapping UI feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and styling details of various frontend files.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point defining Arabic RTL layout and loading the main React application.",
  "frontend/src/App.tsx": "Main app component handling authentication, header layout, tabs, profile setup, and section routing within an RTL UI.",
  "frontend/src/components/auth/LoginGate.tsx": "Wrapper component that blocks content until the user logs in, showing a login card when unauthenticated.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to enter their name, with save logic and defensive modal cleanup behavior.",
  "frontend/src/components/reminders/ReminderDialog.tsx": "Displays a reminder dialog for an order with cleanup logic and formatted date rendering.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Global error boundary that catches React errors and shows a recovery screen with reload option.",
  "frontend/src/features/orders/OrderTrackingSection.tsx": "Manages order CRUD, reminders, and notification permissions with dialogs and cleanup handling.",
  "frontend/src/features/orders/useReminderScheduler.ts": "Hook that checks order reminder times, triggers notifications, and tracks dismissed reminders.",
  "frontend/src/features/pdf/pdfjsConfig.ts": "Loads PDF.js from a CDN using a dynamic module script and exposes its API.",
  "frontend/src/features/pdf/pdfScan.ts": "Scans PDF pages for sensitive words using PDF.js and returns matches with page numbers.",
  "frontend/src/features/pdf/PdfUploadSection.tsx": "Handles PDF file selection, upload with progress, and scanning for sensitive words.",
  "frontend/src/features/sensitiveWords/SensitiveWordsSection.tsx": "UI component to add, edit, delete, and view sensitive words using related query hooks and dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, sensitive words, orders, and file uploads via the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables, RTL support, and custom UI components.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/utils/modalCleanup.ts": "Utility to clean up leftover modal side effects by restoring document and body styles and attributes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters and storing/retrieving them from sessionStorage, including support for hash-based routing and parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and container settings, with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app features, known issues, and architectural notes for an Arabic PDF uploader with sensitive-word management and order tracking."
}