{
  "kind": "build_request",
  "title": "Update the app UI to match the provided WhatsApp screenshot layout and styling",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Restyle the global app shell (header + page background + content container) to visually match the provided screenshot: a clean light background, a compact top bar, and a centered content area with generous whitespace, while preserving RTL layout behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "صمم البرنامج بهذه الطريقة"
        ]
      },
      "acceptanceCriteria": [
        "The app background uses a light, neutral tone similar to the screenshot and the main content appears centered with comfortable spacing on desktop widths.",
        "Header height/spacing is compact and consistent across all tabs (PDF Upload, Sensitive Words, Order Tracking).",
        "RTL remains enabled at the app root and all layouts continue to render correctly in RTL."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Update the tab navigation styling to match the screenshot’s pill-style segmented navigation (rounded tabs, subtle border, clear active state), without changing the existing tab destinations or functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "صمم البرنامج بهذه الطريقة"
        ]
      },
      "acceptanceCriteria": [
        "Tabs render as rounded/pill-like triggers with a clear selected state (background + text contrast) and subtle unselected styling.",
        "Tab navigation remains keyboard-accessible and switching tabs does not break existing content rendering.",
        "No changes are made to the underlying shadcn/ui component sources under `frontend/src/components/ui` (compose styles via className/wrappers only)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Restyle the PDF Upload screen to match the screenshot: a prominent upload card with a large dashed drop-zone, centered iconography, and a primary call-to-action button, while keeping all existing upload/scanning capabilities and keeping scan results in a separate, clearly delineated area (not replacing the upload UI).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "صمم البرنامج بهذه الطريقة"
        ]
      },
      "acceptanceCriteria": [
        "The upload area includes a large dashed border drop-zone with centered content (icon + brief instructions + action button) similar to the screenshot.",
        "Existing behaviors remain intact: PDF-only validation, chunked upload progress, retry/resume behavior, and scan controls/results remain available.",
        "Scan results still appear in a separate dedicated section/card and do not replace or hide the upload controls."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Align cards, borders, radius, and shadow styling across all three sections (PDF Upload, Sensitive Words, Order Tracking) to match the screenshot’s soft card appearance and consistent spacing, without introducing new product features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "صمم البرنامج بهذه الطريقة"
        ]
      },
      "acceptanceCriteria": [
        "Cards across sections have consistent border, radius, and shadow treatment (soft, minimal) and consistent internal padding.",
        "Tables/forms maintain readability in RTL and remain responsive (no horizontal overflow at common mobile widths except where unavoidable for tables).",
        "Any newly introduced user-facing text added during this restyling work is in English (existing Arabic text can remain unchanged)."
      ]
    }
  ],
  "constraints": [
    "Frontend paths listed as immutable must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui` (compose instead of modifying).",
    "Keep the existing single-page RTL structure and existing feature set; this request is a UI/layout restyle to match the provided screenshot.",
    "Do not introduce new backend APIs or change backend data schemas for this restyling task."
  ],
  "nonGoals": [
    "Do not add new modules beyond PDF Upload, Sensitive Words, and Order Tracking.",
    "Do not change authentication behavior (Internet Identity flow remains as-is).",
    "Do not change the upload/scanning protocol or order/sensitive-words data models as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}