{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "WhatsApp-style UI restyle (RTL) for app shell, tabs, and sections",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Restyle global app shell (light background, compact header, centered content) while preserving RTL behavior",
      "acceptanceCriteria": [
        "The app background uses a light, neutral tone similar to the screenshot and the main content appears centered with comfortable spacing on desktop widths.",
        "Header height/spacing is compact and consistent across all tabs (PDF Upload, Sensitive Words, Order Tracking).",
        "RTL remains enabled at the app root and all layouts continue to render correctly in RTL."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the global shell layout to better match the screenshot: compact top bar spacing/typography, a centered content column with max-width and generous whitespace, and consistent container padding across tabs while keeping dir=\"rtl\" at the root."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust global theme tokens and base styles to achieve a clean light neutral background and soft surfaces that match the screenshot; keep RTL-friendly base typography and direction rules intact."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "If needed to match the screenshot precisely, refine Tailwind theme extensions (e.g., container widths, border radius, shadow presets, or semantic color tokens) used by the updated shell styles."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Restyle tab navigation to pill-style segmented control with clear active state, without changing functionality or editing shadcn/ui sources",
      "acceptanceCriteria": [
        "Tabs render as rounded/pill-like triggers with a clear selected state (background + text contrast) and subtle unselected styling.",
        "Tab navigation remains keyboard-accessible and switching tabs does not break existing content rendering.",
        "No changes are made to the underlying shadcn/ui component sources under `frontend/src/components/ui` (compose styles via className/wrappers only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Compose pill/segmented styling by adjusting className on TabsList and TabsTrigger (rounded container, subtle border, active state contrast) while keeping the same tab values/destinations and preserving keyboard accessibility. Do not modify any files under frontend/src/components/ui."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust any global utility layer overrides needed for the pill tabs appearance (e.g., focus ring consistency in RTL) without touching shadcn/ui component source files."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Restyle PDF Upload screen with a prominent upload card and large dashed drop-zone + primary CTA, keeping upload/scanning behaviors and separating scan results",
      "acceptanceCriteria": [
        "The upload area includes a large dashed border drop-zone with centered content (icon + brief instructions + action button) similar to the screenshot.",
        "Existing behaviors remain intact: PDF-only validation, chunked upload progress, retry/resume behavior, and scan controls/results remain available.",
        "Scan results still appear in a separate dedicated section/card and do not replace or hide the upload controls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/pdf/PdfUploadSection.tsx",
          "operation": "modify",
          "description": "Restructure and restyle the upload UI to match the screenshot: a prominent Card, a larger dashed drop-zone with centered iconography/instructions, and a primary CTA button; keep the existing file input/validation, chunked upload progress, and scan controls. Ensure scan results remain rendered in a separate, clearly delineated Card below the upload card."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add any global style refinements required by the updated upload drop-zone (e.g., consistent dashed border color, muted background tint, and focus/hover states) while keeping RTL base rules."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Align card/border/radius/shadow styling and spacing across PDF Upload, Sensitive Words, and Order Tracking without adding new features",
      "acceptanceCriteria": [
        "Cards across sections have consistent border, radius, and shadow treatment (soft, minimal) and consistent internal padding.",
        "Tables/forms maintain readability in RTL and remain responsive (no horizontal overflow at common mobile widths except where unavoidable for tables).",
        "Any newly introduced user-facing text added during this restyling work is in English (existing Arabic text can remain unchanged)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/pdf/PdfUploadSection.tsx",
          "operation": "modify",
          "description": "Apply consistent card spacing and soft surface styling (borders/radius/shadows/padding) to the upload card and scan results card; keep tables readable in RTL and avoid unnecessary horizontal overflow."
        },
        {
          "path": "frontend/src/features/sensitiveWords/SensitiveWordsSection.tsx",
          "operation": "modify",
          "description": "Align both cards (add + list) to the same soft card styling and spacing as the screenshot; keep the words table responsive and readable in RTL (e.g., allow horizontal scroll only when unavoidable)."
        },
        {
          "path": "frontend/src/features/orders/OrderTrackingSection.tsx",
          "operation": "modify",
          "description": "Align the orders card, tables, and dialogs with the same soft card styling, consistent padding, and spacing; keep the orders table responsive (overflow-x-auto only at small widths) and ensure RTL readability remains intact."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Introduce/adjust shared styling conventions for cards/surfaces (e.g., consistent shadow strength, border color, radius token) so all three sections visually match and remain consistent across the app."
        }
      ]
    }
  ]
}